
{
    "personal data": {
      "name": "Tejas Gathekar",
      "desc": "An experienced Flutter developer with 2.5 years of experience in developing and maintaining mobile applications. Skilled in building robust and user-friendly applications using Flutter and Dart. Proficient in implementing RESTful APIs, integrating third-party libraries, and optimizing app performance. Seeking a challenging role in a dynamic organization where I can contribute my skills and knowledge to develop innovative and impactful mobile applications."
    },
    "experience":{
        "data":[
            "Accenture Pvt Ltd":[
                "from":"sep-2021",
                "to":"present",
                "desc":[ "Designed and developed user-friendly mobile applications using Flutter and Dart for Android platforms.",
                    "Collaborated with cross-functional teams including designers, project managers, and quality assurance engineers to ensure timely delivery of high-quality applications.",
                    "Implemented RESTful APIs to retrieve and update data from the backend server and Integrated Firebase and SQLite for data storage, authentication, and push notifications.",
                    "Utilized GetX and Provider for state management and efficient code reusability Implemented Material Design and responsive UI/UX design for better user experience.",
                    "Optimized app performance by identifying and resolving issues related to memory leaks and app crashes Followed Agile methodologies for project management and version control using Git and Github."]
                    
            ],
            "Vensark Tech. Pvt Ltd":[
                "from":"07-2020",
                "to":"08-2021",
                "desc":[
                    "Developed and maintained the corporate website and Android application using WordPress and Flutter SDK.", 
"Utilized Firebase for backend and push notification services for mobile applications. Followed best practices for Flutter, React, and WordPress development including component-based architecture, state management, and debugging.",
"Worked closely with clients to understand their requirements and provide effective solutions."
                ]
            ]
        ]
    },
    "project data": {
      "data": [
        {
          "name": "SMPO APP",
          "desc": "Developed and launched an exclusive social media platform for organization/institution members, resulting in a 40% increase in user engagement and fostering a sense of community among students and staff.\nPeople can share media (pictures, text) and others can have the opportunity to comment on and respond to them.\nThe superior authorities (teachers) may assign a task to the student at the end, state of completion notified to the authorities.\nIt's available on the web and the Android mobile app.",
          "images":[],
          "web-link": "https://tejasg-007.github.io/SocialMEdiaApp.github.io/#/",
          "git-link":"https://github.com/TejasG-007/SocialMEdiaApp.github.io.git"
        },
        {
            "name": "TODO APP",
            "desc": "Crafted with Flutter for Android and powered by Firebase, our innovative Todo app delivers efficient task management and organization. Its user-friendly interface ensures a seamless experience, allowing users to create, categorize, and prioritize tasks with ease. Real-time synchronization through Firebase keeps tasks up-to-date across devices, fostering collaboration and enhancing productivity. The app's cross-platform compatibility and integration with Firebase's security features provide users with a reliable and secure task management solution. With features like task completion tracking, reminders, and notifications, our app empowers users to stay on top of their responsibilities while enjoying a smooth, responsive performance.",
             "images":[],
            "web-link": "",
            "git-link":"https://github.com/TejasG-007/Todo-App.git"
          },
    
          {
            "name": "SHAKUNTAL SCHOOL WORDPRESS",
            "desc": "I designed and developed the website for Shankuntal School using WordPress, showcasing my proficiency in web development. In addition, I provided exceptional client support, ensuring their needs were met effectively. Through this project, I demonstrated my ability to create functional and visually appealing websites while delivering outstanding service to the client.",  
            "images":[],
            "web-link": "https://shakuntalschool.com/",
            "git-link":""
          },
          {
            "name": "IT-PLANET WORDPRESS",
            "desc": "During my internship at Vensark Tech in Nanded, I successfully developed an E-Commerce website named IT-World Shop using WordPress and WooCommerce. This platform serves as an online marketplace for IT-related products and services. By integrating WooCommerce into WordPress, I enabled features such as product listings, secure payment gateways, and order management, creating a seamless shopping experience for customers. This real-world project allowed me to apply my technical skills to enhance online shopping accessibility and gain valuable insights into E-Commerce development, user engagement, and practical web design.", 
            "images":[],
            "web-link": "https://https://itplanet.shop/",
            "git-link":""
          },
        {
          "name": "PORTFOLIO FLUTTER",
          "desc": "I developed a responsive portfolio website using the Flutter framework, highlighting my proficiency in web development. This site not only showcases my skills and projects but also offers users the flexibility to customize the theme color according to their preferences. Through this project, I aimed to provide visitors with an interactive and visually appealing platform that reflects my capabilities while allowing them to personalize their browsing experience.",
          "images":[],
          "web-link":"https://tejasg-007.github.io/tejasg.flutter.github.io/",
          "git-link": ""
        },
        {
            "name": "QUOTES APP",
            "desc": "I created a mobile application using the Flutter framework that features an assortment of insightful quotes curated from renowned individuals. This project showcases my skills in app development and my commitment to offering users a collection of impactful quotes that have been attributed to great minds. Through this endeavor, I aimed to provide users with inspiration and wisdom encapsulated in the words of distinguished figures.", 
            "images":[],
            "web-link":"https://play.google.com/store/apps/details?id=com.mateg.shayari",
            "git-link": ""
          },
          {
            "name": "MEDG APP",
            "desc": "Designed and developed the MedG Android App, Especially for people who stay away from home.\nhe app will be responsible for the monitoring and management of the user's health report.\nIt will notify the person closest to the user when the user is not feeling well or has an illness.",
            "images":[],
            "web-link":"",
            "git-link": "https://github.com/TejasG-007/MedG-byt.git"
          },
         
      ]
    },
    "site data": {
        "copyright":"copyright@2023 TejasG",

    }
  }
